---
type: ExternalEvent
namespace: Autodesk.Revit.UI
version: 2024
members: 5
tags: [revit-api, class]
---

# ExternalEvent

`Autodesk.Revit.UI.ExternalEvent` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2013 | `public static ExternalEvent Create ( IExternalEventHandler handler )` |
| Method | CreateJournalable | 2015 | `public static ExternalEvent CreateJournalable ( IExternalEventHandler handler )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | Raise | 2013 | `public ExternalEventRequest Raise ()` |
| Property | IsPending | 2013 | `public bool IsPending { get ; }` |